jimmywong2003/nrf52-ble-range-estimator/ble_peripheral_long_range_demo_kit/main.c
}
/**@snippet [Handling the data received over BLE] */


static void its_evt_handler(ble_its_t *p_its, ble_its_evt_t const *p_its_evt)
{
        switch (p_its_evt->evt_type)
        {
        case BLE_ITS_EVT_ITS_RX_DATA_EVT:
                break;
        default:
                break;
        }
}

static void fts_evt_handler(ble_fts_t *p_fts, ble_fts_evt_t const *p_fts_evt)
{
        switch (p_fts_evt->evt_type)
        {
        case BLE_FTS_EVT_TX_CMD_READY:
                NRF_LOG_INFO("BLE_FTS_EVT_TX_CMD_READY");
                break;
        case BLE_FTS_EVT_TX_DATA_READY:
                NRF_LOG_INFO("BLE_FTS_EVT_TX_DATA_READY");
                break;
        case BLE_FTS_EVT_TX_DATA_COMPLETE: /**< Event indicating that the central has received something from a peer. */
                break;
        case BLE_FTS_EVT_RX_CMD_RECEIVED: /**< Event indicating that the central has received something from a peer. */
                NRF_LOG_INFO("BLE_FTS_EVT_RX_CMD_RECEIVED");
                NRF_LOG_HEXDUMP_INFO(p_fts_evt->p_data, p_fts_evt->data_len);
                break;
        case BLE_FTS_EVT_RX_DATA_RECEIVED: /**< Event indicating that the central has written to peripheral. */
                NRF_LOG_INFO("BLE_FTS_EVT_RX_DATA_RECEIVED");
                NRF_LOG_HEXDUMP_INFO(p_fts_evt->p_data, p_fts_evt->data_len);
                break;
        case BLE_FTS_EVT_RX_DATA_COMPLETE: /**< Event indicating that the central has written to peripheral completely. */
                break;
        case BLE_FTS_EVT_CONNECTED: /**< Event indicating that the NUS server has disconnected. */
                NRF_LOG_INFO("BLE_FTS_EVT_CONNECTED");
                break;
        case BLE_FTS_EVT_DISCONNECTED:              /**< Event indicating that the NUS server has disconnected. */
                break;

        default:
                break;
        }
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
        uint32_t err_code;
        ble_nus_init_t nus_init;
        ble_its_init_t its_init;
        ble_fts_init_t fts_init;
        nrf_ble_qwr_init_t qwr_init = {0};

        // Initialize Queued Write Module.
        qwr_init.error_handler = nrf_qwr_error_handler;

        err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
        APP_ERROR_CHECK(err_code);

        memset(&its_init, 0, sizeof(its_init));
        // Initialize ITS.
        its_init.evt_handler = its_evt_handler;
        err_code = ble_its_init(&m_its, &its_init);
        APP_ERROR_CHECK(err_code);
//
        // // Initialize NUS.
        memset(&nus_init, 0, sizeof(nus_init));
        nus_init.data_handler = nus_data_handler;
        err_code = ble_nus_init(&m_nus, &nus_init);
        APP_ERROR_CHECK(err_code);

        memset(&fts_init, 0, sizeof(fts_init));
        // Initialize file transfer service.
        fts_init.evt_handler = fts_evt_handler;
        err_code = ble_fts_init(&m_fts, &fts_init);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
        uint32_t err_code;

        if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
        {
                err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
                APP_ERROR_CHECK(err_code);
        }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
        uint32_t err_code;
        ble_conn_params_init_t cp_init;

        memset(&cp_init, 0, sizeof(cp_init));

        cp_init.p_conn_params                  = NULL;
        cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
        cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
        cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
        cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
        cp_init.disconnect_on_fail             = false;
        cp_init.evt_handler                    = on_conn_params_evt;
        cp_init.error_handler                  = conn_params_error_handler;

        err_code = ble_conn_params_init(&cp_init);
        APP_ERROR_CHECK(err_code);
}


/****************************************************************/
static void Get_Connect_MAC_Address(ble_gap_addr_t *gap_address)
{
        NRF_LOG_INFO("Connected to ESL address to: %02X:%02X:%02X:%02X:%02X:%02X",
                     gap_address->addr[5],
                     gap_address->addr[4],
                     gap_address->addr[3],
                     gap_address->addr[2],
                     gap_address->addr[1],
                     gap_address->addr[0]);
}


/**@brief Function for handling BLE_GAP_EVT_CONNECTED events.
 * Save the connection handle and GAP role.
 * Turn on the "connected state" LED.
 */
static void on_ble_gap_evt_connected(ble_gap_evt_t const * p_gap_evt)
{
        ret_code_t err_code;

        m_conn_handle = p_gap_evt->conn_handle;
        m_gap_role    = p_gap_evt->params.connected.role;

        int8_t tx_power = (int8_t)(m_application_state.tx_power * 4);

        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, tx_power);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_INFO("on_ble_gap_evt_connected TX Power = %d", tx_power);

        if (m_gap_role == BLE_GAP_ROLE_PERIPH)
        {
                NRF_LOG_INFO("Connected as a peripheral.");
        }
        else if (m_gap_role == BLE_GAP_ROLE_CENTRAL)
        {
                NRF_LOG_INFO("Connected as a central. Should not happen.");
        }

        //If advertising, stop advertising.
        (void) sd_ble_gap_adv_stop(m_adv_handle);

