jimmywong2003/nrf52-ble-range-estimator/ble_peripheral_long_range_demo_kit/main.c
}


/**@brief Function for handling BLE_GAP_EVT_DISCONNECTED events.
 * Unset the connection handle and restart advertising if needed.
 */
static void on_ble_gap_evt_disconnected(ble_gap_evt_t const * p_gap_evt)
{
        m_conn_handle = BLE_CONN_HANDLE_INVALID;
        m_waiting_for_disconnect_evt = false;

        NRF_LOG_DEBUG("Disconnected: reason 0x%x.", p_gap_evt->params.disconnected.reason);

        if (m_app_initiated_disconnect == false) // (If a the app itself (button push) has initiated a disconnect, bsp_evt_handler will start the advertising.)
        {
                // Start advertising with the current setup.
                bsp_board_leds_off();
                set_current_adv_params_and_start_advertising();
        }

}



/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
        uint32_t err_code;

        ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_CONNECTED:

                NRF_LOG_INFO("Connected: %i", p_ble_evt->evt.gap_evt.conn_handle);

                bsp_board_led_on(CONNECTED_LED);
                bsp_board_led_off(ADVERTISING_LED);

                m_advertising_is_running  = false;

                m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
                APP_ERROR_CHECK(err_code);

                on_ble_gap_evt_connected(p_gap_evt);

                err_code = sd_ble_gap_rssi_start(p_ble_evt->evt.gap_evt.conn_handle, 1, 2);
                APP_ERROR_CHECK(err_code);

                // NRF_LOG_HEXDUMP_INFO(p_gap_evt->params.connected.peer_addr.addr, 6);
                Get_Connect_MAC_Address((ble_gap_addr_t *)&p_gap_evt->params.connected.peer_addr);

                packet_error_rate_reset_counter();
                packet_error_rate_detect_enable();

                m_application_state.app_state = APP_STATE_CONNECTED;
                display_update();

                break;

        case BLE_GAP_EVT_DISCONNECTED:
                NRF_LOG_INFO("Disconnected. conn_handle: 0x%x, reason: 0x%x",
                             p_gap_evt->conn_handle,
                             p_gap_evt->params.disconnected.reason);

                // LED indication will be changed when advertising starts.
                m_conn_handle = BLE_CONN_HANDLE_INVALID;
                m_advertising_is_running  = false;

                m_application_state.rssi[p_ble_evt->evt.gap_evt.conn_handle] = 0;

                packet_error_rate_detect_disable();

                if(m_application_state.app_state == APP_STATE_CONNECTED)
                {
                        m_application_state.app_state = APP_STATE_DISCONNECTED;

                        err_code = app_timer_start(m_restart_advertising_timer_id, APP_TIMER_TICKS(RESTART_ADVERTISING_TIMEOUT_MS), 0);
                        APP_ERROR_CHECK(err_code);


                }

                display_update();

                break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
                NRF_LOG_DEBUG("PHY update request.");
                ble_gap_phys_t const phys =
                {
                        .rx_phys = BLE_GAP_PHY_AUTO,
                        .tx_phys = BLE_GAP_PHY_AUTO,
                };
                err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
                APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
                // Pairing not supported
                err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
                // No system attributes have been stored.
                err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTC_EVT_TIMEOUT:
                // Disconnect on GATT Client timeout event.
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTS_EVT_TIMEOUT:
                // Disconnect on GATT Server timeout event.
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GAP_EVT_RSSI_CHANGED:
                if (rssi_count % 10 == 0)
                {
                        packet_error_rate_timeout_handler();
                        NRF_LOG_INFO("RSSI = %d (dBm), PSR = %03d%%", p_ble_evt->evt.gap_evt.params.rssi_changed.rssi, get_packet_success_rate());
                        m_application_state.psr = get_packet_success_rate();
                        m_application_state.rssi[p_ble_evt->evt.gap_evt.conn_handle] = p_ble_evt->evt.gap_evt.params.rssi_changed.rssi;
                        display_update();
                }
                rssi_count++;
                break;

        default:
                // No implementation needed.
                break;
        }
}

/**@brief Function for starting advertising with the current selections of output power, phy, and connectable or non-connectable advertising.
 */
static void set_current_adv_params_and_start_advertising(void)
{

//        phy_selection_set_state(m_adv_scan_phy_selected);
//        on_non_conn_or_conn_adv_selection_state_set(m_adv_scan_type_selected);
//        output_power_selection_set(m_output_power_selected);

//        advertising_data_set();
//        advertising_start();

