jimmywong2003/nrf52-ble-range-estimator/ble_peripheral_long_range_demo_kit/main.c
        //ble_uuid_t adv_uuids[] = {{LBS_UUID_SERVICE, m_lbs.uuid_type}};

        NRF_LOG_INFO("Advertising init");

        // Build and set advertising data.
        memset(&advdata, 0, sizeof(advdata));

        advdata.name_type          = BLE_ADVDATA_FULL_NAME;
        advdata.include_appearance = false;
        advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

        memset(&srdata, 0, sizeof(srdata));

        err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
        APP_ERROR_CHECK(err_code);

        err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data, &m_adv_data.scan_rsp_data.len);
        APP_ERROR_CHECK(err_code);

        ble_gap_adv_params_t adv_params;

        // Set advertising parameters.
        memset(&adv_params, 0, sizeof(adv_params));

        if(m_application_state.phy == APP_PHY_CODED)
        {

                NRF_LOG_INFO("Set to PHY Coded");
                adv_params.primary_phy     = BLE_GAP_PHY_CODED;
                adv_params.secondary_phy   = BLE_GAP_PHY_CODED;
                adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;
        }
        else
        {
                NRF_LOG_INFO("Set to 1 Mbps");
                adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
                adv_params.secondary_phy   = BLE_GAP_PHY_1MBPS;
                adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
        }
        adv_params.duration        = APP_ADV_DURATION;
        adv_params.p_peer_addr     = NULL;
        adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
        adv_params.interval        = APP_ADV_INTERVAL;

        err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
        APP_ERROR_CHECK(err_code);

        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, m_application_state.tx_power * 4);
        APP_ERROR_CHECK(err_code);
}




static void ble_go_to_idle(void)
{
        ret_code_t err_code;

        NRF_LOG_INFO("%s : App_state %d", m_application_state.app_state);
        switch(m_application_state.app_state)
        {
        case APP_STATE_ADVERTISING:
                NRF_LOG_INFO("Advertising Stop");
                err_code = sd_ble_gap_adv_stop(m_adv_handle);
                APP_ERROR_CHECK(err_code);
                break;

        case APP_STATE_CONNECTED:
                if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
                {
                        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                        APP_ERROR_CHECK(err_code);
                }
                break;

        case APP_STATE_DISCONNECTED:
                err_code = app_timer_stop(m_restart_advertising_timer_id);
                APP_ERROR_CHECK(err_code);
                break;
        }
        m_application_state.app_state = APP_STATE_IDLE;
        display_update();
}


static void display_update()
{
        static bool first_update = true;
        if(first_update)
        {
                m_application_state.main_title = "Peripheral LRange";
                app_display_create_main_screen(&m_application_state);
                first_update = false;
        }
        else
        {
                app_display_update_main_screen(&m_application_state);
        }
        app_display_update();
}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
        ret_code_t err_code;
        ble_gap_phys_t phys;

        switch (pin_no)
        {
        case PHY_SELECTION_BUTTON:
                if(button_action == APP_BUTTON_PUSH && m_application_state.app_state == APP_STATE_IDLE)
                {
                        m_application_state.phy = (m_application_state.phy + 1) % APP_PHY_LIST_END;
                        advertising_init();
                        display_update();
                }
                break;

        case TX_POWER_BUTTON:
                if(button_action == APP_BUTTON_PUSH)
                {
                        m_application_state.tx_power = (m_application_state.tx_power + 1) % 3;
                        int8_t tx_power = (int8_t)(m_application_state.tx_power * 4);
                        if(m_application_state.app_state == APP_STATE_CONNECTED)
                        {
                                err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, tx_power);
                                APP_ERROR_CHECK(err_code);
                                NRF_LOG_INFO("TX Power for Connection: %d", tx_power);
                        }
                        else
                        {
                                err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, tx_power);
                                APP_ERROR_CHECK(err_code);
                                NRF_LOG_INFO("TX Power for Advertising: %d", tx_power);
                        }
                        display_update();
                }
                break;

        case APP_STATE_BUTTON:
                if(button_action == APP_BUTTON_PUSH)
                {
                        NRF_LOG_INFO("Press the APP_STATE_BUTTON %d", m_application_state.app_state);
                        if(m_application_state.app_state == APP_STATE_IDLE)
                        {
                                advertising_start();
                        }
                        else
                        {
                                ble_go_to_idle();
                        }
                }
                break;

        case THROUGHPUT_TEST_BUTTON:
                m_application_state.button_pressed = button_action;
                display_update();
                break;

        default:
                APP_ERROR_HANDLER(pin_no);
                break;
        }
}

