jimmywong2003/nrf52-ble-range-estimator/ble_peripheral_long_range_demo_kit/main.c
/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {PHY_SELECTION_BUTTON,       false, BUTTON_PULL, button_event_handler},
                {TX_POWER_BUTTON,  false, BUTTON_PULL, button_event_handler},
                {APP_STATE_BUTTON, false, BUTTON_PULL, button_event_handler},
                {THROUGHPUT_TEST_BUTTON, false, BUTTON_PULL, button_event_handler}
        };

        err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);

        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
        app_sched_execute();
        if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
        ret_code_t err_code;

        if (m_application_state.app_state == APP_STATE_IDLE)
        {
                err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
                if(err_code == NRF_SUCCESS)
                {
                        bsp_board_led_on(ADVERTISING_LED);

                        m_application_state.app_state = APP_STATE_ADVERTISING;
                        display_update();
                }
                else
                {
                        APP_ERROR_CHECK(err_code);
                }
        }
        else if (m_application_state.app_state == APP_STATE_DISCONNECTED)
        {
                err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
                if(err_code == NRF_SUCCESS)
                {
                        bsp_board_led_on(ADVERTISING_LED);

                        m_application_state.app_state = APP_STATE_ADVERTISING;
                        display_update();
                }
                else
                {
                        APP_ERROR_CHECK(err_code);
                }
        }

}

/**@brief Application main function.
 */
int main(void)
{
        bool erase_bonds;

        // Initialize.
        uart_init();
        log_init();
        timers_init();

        buttons_init();
        power_management_init();
        ble_stack_init();
        scheduler_init();
        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        // Start execution.
        NRF_LOG_INFO("\n\n\n\n");
        NRF_LOG_INFO("New Firmware Start %s", (uint8_t *)DEVICE_NAME);
//        advertising_start();

        app_display_init(&m_application_state);
        display_update();

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}


/**
 * @}
 */
